[
  {
    "title": "Auto Insurance Discounts",
    "content": "SafeGuard offers various auto insurance discounts: Safe Driver Discount (25% off for 5+ years claim-free), Multi-Policy Discount (15% when bundling auto and home), Good Student Discount (10% for students with B average or better), Defensive Driving Course (5% discount), Anti-theft Device (up to 10% discount), Low Mileage Discount (5-15% for driving less than 7,500 miles annually).",
    "category": "discounts",
    "tags": [
      "auto",
      "discounts",
      "savings"
    ]
  },
  {
    "title": "Filing a Home Insurance Claim",
    "content": "Steps to file a home insurance claim: 1) Ensure safety first, 2) Contact emergency services if needed, 3) Document damage with photos and videos, 4) Call SafeGuard claims hotline at 1-800-SAFEGUARD, 5) Make temporary repairs to prevent further damage, 6) Keep receipts for temporary repairs and living expenses, 7) Meet with the adjuster, 8) Review the settlement offer carefully.",
    "category": "claims",
    "tags": [
      "home",
      "claims",
      "process"
    ]
  },
  {
    "title": "Understanding Health Insurance Networks",
    "content": "Health insurance networks determine your out-of-pocket costs. In-Network providers have contracted rates and lower costs to you. Out-of-Network providers may result in higher costs or no coverage. Always verify provider network status before appointments. Emergency services are typically covered regardless of network status.",
    "category": "health",
    "tags": [
      "health",
      "networks",
      "providers"
    ]
  },
  {
    "title": "Life Insurance Beneficiaries",
    "content": "Beneficiary designation is crucial for life insurance. Primary beneficiaries receive the death benefit first. Contingent beneficiaries receive benefits if primary beneficiaries predecease the insured. You can name multiple beneficiaries and specify percentages. Update beneficiaries after major life events like marriage, divorce, or birth of children.",
    "category": "life insurance",
    "tags": [
      "life",
      "beneficiaries",
      "planning"
    ]
  }
]